In [89]:
import pandas as pd

In [90]:
forum_users = {
    'User ID': [1,2,3,4,5],
    'Username': ['bob_s','jane_smith','alex123','bob56','mark'],
    'Age': [18,35,25,38,None],
    'Joined Date': ['2023-01-01','2023-01-01','2023-05-01','2023-04-11','2023-12-31',],
    'Total Posts': [150,230,80,420,310],
    'Reputation': [500,720,200,940,500]
}
df = pd.DataFrame(forum_users)
df

   User ID    Username   Age Joined Date  Total Posts  Reputation
0        1       bob_s  18.0  2023-01-01          150         500
1        2  jane_smith  35.0  2023-01-01          230         720
2        3     alex123  25.0  2023-05-01           80         200
3        4       bob56  38.0  2023-04-11          420         940
4        5        mark   NaN  2023-12-31          310         500

In [91]:
df.shape

(5, 6)

In [92]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [93]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [94]:
df.dtypes

User ID          int64
Username        object
Age            float64
Joined Date     object
Total Posts      int64
Reputation       int64
dtype: object

In [95]:
df.values

array([[1, 'bob_s', 18.0, '2023-01-01', 150, 500],
       [2, 'jane_smith', 35.0, '2023-01-01', 230, 720],
       [3, 'alex123', 25.0, '2023-05-01', 80, 200],
       [4, 'bob56', 38.0, '2023-04-11', 420, 940],
       [5, 'mark', nan, '2023-12-31', 310, 500]], dtype=object)

In [96]:
df.values[1,1]

'jane_smith'

In [97]:
df.head()

   User ID    Username   Age Joined Date  Total Posts  Reputation
0        1       bob_s  18.0  2023-01-01          150         500
1        2  jane_smith  35.0  2023-01-01          230         720
2        3     alex123  25.0  2023-05-01           80         200
3        4       bob56  38.0  2023-04-11          420         940
4        5        mark   NaN  2023-12-31          310         500

In [98]:
df.describe().round(2)

       User ID    Age  Total Posts  Reputation
count     5.00   4.00          5.0        5.00
mean      3.00  29.00        238.0      572.00
std       1.58   9.20        133.3      276.62
min       1.00  18.00         80.0      200.00
25%       2.00  23.25        150.0      500.00
50%       3.00  30.00        230.0      500.00
75%       4.00  35.75        310.0      720.00
max       5.00  38.00        420.0      940.00

In [99]:
df.select_dtypes(include='object')

     Username Joined Date
0       bob_s  2023-01-01
1  jane_smith  2023-01-01
2     alex123  2023-05-01
3       bob56  2023-04-11
4        mark  2023-12-31

In [100]:
df.isna().sum()

User ID        0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64

In [101]:
df['Joined Date'] = pd.to_datetime(df['Joined Date'])
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

## Series

In [102]:
df['Username']

0         bob_s
1    jane_smith
2       alex123
3         bob56
4          mark
Name: Username, dtype: object

In [103]:
type(df['Username'])

pandas.core.series.Series

In [104]:
username_series = df['Username']
username_series

0         bob_s
1    jane_smith
2       alex123
3         bob56
4          mark
Name: Username, dtype: object

In [105]:
type(username_series.values)

numpy.ndarray

In [106]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [108]:
df['Reputation'].value_counts()

Reputation
500    2
720    1
200    1
940    1
Name: count, dtype: int64

In [109]:
df['Reputation'].unique()

array([500, 720, 200, 940])

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1    bob_s  18.0  2023-01-01          150         500
4        5     mark   NaN  2023-12-31          310         500